In [5]:
# task 1

import pandas as pd

a = {
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

authors = pd.DataFrame(a)


b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и Дети', 'Рудин', 'Дворянское Гнездо', 'Толстый и Тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и покойники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}

book = pd.DataFrame(b)

book

   author_id           book_title  price
0          1          Отцы и Дети    450
1          1                Рудин    300
2          1    Дворянское Гнездо    350
3          2     Толстый и Тонкий    500
4          2      Дама с собачкой    450
5          3                Гроза    370
6          3  Таланты и покойники    290

In [6]:
# task 2

authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

   author_id author_name           book_title  price
0          1    Тургенев          Отцы и Дети    450
1          1    Тургенев                Рудин    300
2          1    Тургенев    Дворянское Гнездо    350
3          2       Чехов     Толстый и Тонкий    500
4          2       Чехов      Дама с собачкой    450
5          3  Островский                Гроза    370
6          3  Островский  Таланты и покойники    290

In [8]:
# task 3

top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и Тонкий    500
0          1    Тургенев        Отцы и Дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское Гнездо    350

In [31]:
# task 4

authors_stat = authors_price.groupby('author_name').agg(min_price=('price', 'min'),
                                                        max_price=('price', 'max'),
                                                        mean_price=('price', 'mean'))
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [47]:
#task 5

import numpy as np

authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

book_info = pd.pivot_table(authors_price, values='price', index='author_name', columns='cover', aggfunc=np.sum, fill_value=0)

book_info.to_pickle("book_info.pkl")

book_info2 = pd.read_pickle("book_info.pkl")
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950